; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:       ULTIMA PRIME <tcmdup@gmail.com>
; Homepage:     http://www.tcup.pl
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Anuluj"
MAIN_DEST_DIR_LABEL = "&Katalog docelowy:"
MAIN_FILE_LABEL = "&Archiwum/Instalator do wypakowania:"
MENU_FILE_LABEL = "&Plik"
MENU_FILE_QUIT_LABEL = "&Zakończ"
MENU_EDIT_LABEL = "&Edycja"
MENU_EDIT_PREFS_LABEL = "&Ustawienia"
MENU_HELP_LABEL = "&Pomoc"
MENU_HELP_WEB_LABEL = "%s &Strona domowa"
PREFS_TITLE_LABEL = "Ustawienia"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opcje"
PREFS_HISTORY_LABEL = "Zapamiętuj &historię archiwów"
PREFS_FORMAT_OPTS_LABEL = "Format - Specyficzne Opcje"
PREFS_LANG_LABEL = "&Język"
PREFS_DEBUG_LABEL = "&Katalog pliku debugowania:"
PREFS_WARN_EXECUTE_LABEL = "&Ostrzegaj przed wykonyw. plików"
PREFS_REMOVE_DUPE_LABEL = "&Usuń zduplikowane pliki"
PREFS_REMOVE_TEMP_LABEL = "Usuń &pliki tymczasowe"
PREFS_APPEND_EXT_LABEL = "&Dopisz brakujące rozszerzenia"
METHOD_ADMIN_RADIO = "Instalator administracyjny %s"
METHOD_EXTRACTION_RADIO = "Wypakowaywanie %s"
METHOD_HEADER = "Wypakowywanie %s"
METHOD_MSI_NOTE_LABEL = "Uwaga:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml wymaga"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Metoda wypakowywania"
METHOD_SWITCH_RADIO = "przełącz %s"
METHOD_NOTIS_RADIO = "Instalator inny niż InstallShield"
METHOD_TEXT_LABEL = "%s wspomaga następujące metody wypakowywania %s. Niestety, żadna z tych metod nie jest w 100% niezawodna. Jeśli wydaje się że domyślna metoda nie działa, proszę uruchom ponownie %s i zaznacz alternatywną metodę."
METHOD_UNPACKER_RADIO = "Wypakowywacz"

; GUI control functions
DOES_NOT_EXIST = "nie istnieje.%n"
EXTRACT_TO = "Wypakuj do"
INVALID_DIR_SELECTED =  "%s nie jest właściwym katalogiem."
INVALID_FILE_SELECTED = "%sProszę wybrać właściwy plik."
OPEN_FILE = "Otwórz plik"
SELECT_FILE = "Wybierz plik"
WRITE_TO = "Zapisz do"

; Common terms
TERM_ARCHIVE = "archiwum"
TERM_COMPRESSED = "skompresowany plik"
TERM_DISK = "dysk"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "odszyfrowany plik"
TERM_EXECUTABLE = "wykonywalny"
TERM_FAILED = "uszkodzony"
TERM_HELP = "Plik pomocy"
TERM_HOTFIX = "poprawka"
TERM_IMAGE = "obraz"
TERM_INSTALLER = "instalator"
TERM_PACKAGE = "spakowany"
TERM_PATCH = "patch"
TERM_SFX = "Samorozpakowujący"
TERM_STAGE = "Faza"
TERM_SUCCEEDED = "powiodło się"
TERM_TESTING = "Testowany"
TERM_UNKNOWN = "nieznany"
TERM_UNPACKED = "wypakowany"
TERM_UPDATER = "uaktualniacz"

; Status messages
SCANNING_FILE = "Skanowanie pliku w celu ustalenia rodzaju pliku."
SCANNING_EXE = "Skanowanie pliku z %s skanowaniem."
EXTRACTING = "Wypakowywanie plików z:"
INIT_WAIT = "Oczekiwanie na uruchomienie instalatora.%nProszę czekać."

; Custom prompts
CONVERT_CDROM = "Obraz %s nie może zostać wypakowany bezpośednio. Zamiast tego obraz %nzostanie przekonwerterowany do formatu ISO CD-ROM a następnie wypakowany.%n%nCzy chcesz kontynuować?%nUwaga: Ten proces może zająć kilka minut."
CONVERT_CDROM_STAGE1_FAILED = "Błąd:  Obraz CD-ROM nie może być przekonwerterowany.%nUpewnij się czy plik CUE ma właściwy format."
CONVERT_CDROM_STAGE2_FAILED = "Błąd:  Obraz ISO został utworzony z obrazu %s, ale nie mógł być przekonwerterowany.%nCzy chcesz zachować obraz ISO do późniejszej analizy?"
CONVERT_BIN_MISSING = "Błąd: Nie można odnaleźć:%n%s\%s.%s%n%nPliki %s.bin i %s.cue są potrzebne."
INIT_COMPLETE = "Rozpoczęcie %s. Proszę wyjść z instalatora i kliknąć OK aby kontynuować."
WISE_MSI_PROMPT = "Uwaga: Ta metoda działa tylko ze specyficznym "Wise for Windows Installer".%nGdy Wise Installation Wizard jest uruchomiony i oczekuje na dane, plik ten nie jest%obsługiwany. Proszę wyłączyć instalator i %s zakończyć rozpakowywanie.%n%nCzy chcesz kontynuować?"
UNPACK_PROMPT = "Ten plik jest spakowany kompresją %s, ale nie może być wypakowany.%nMoże tak być dlatego że plik nie jest obsługiwany lub po prostu nie ma żadnych elementów do wypakowania.%n%nCzy chcesz wypakować ten plik?%n%nUwaga: Rozpakowany plik będzie miał nazwę:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Błąd: %s%nNie można wypakować."
WARN_EXECUTE = Ostrzezenie: Aby wypakowac pliki tego typu, plik musi zostac uruchomiony bezposrednio. Jesli bedziesz kontynulowal, nastepujaca komenda zostanie wykonana %n%n%s%n%n. Jesli uwazaz, ze ten plik moze zawierac zlosliwe oprogramowanie, zalaca sie anulowanie tej akcji.n% Czy chcesz kontynulowac wypakowanie wskutek bezposredniego uruchomienia tego pliku?

; Help text
HELP_SUMMARY = "Wypakuj pliki z każdego typu archiwum lub instalatorów."
HELP_SYNTAX = "%nUżycie:  %s [/pomoc] [nazwa pliku [cel]]"
HELP_ARGUMENTS = "%n%nObsługiwane argumenty:"
HELP_HELP = "%n     /pomoc%t%tWyświetlaj tą informację pomocy"
HELP_FILENAME = "%n     nazwa pliku%tNazwa pliku do wypakowania"
HELP_DESTINATION = "%n     cel%tKatalog do którego będzie wypakowywane"
HELP_SUB = "%n%nPrzekazywanie /sub zamiast docelowej nazwy folderu instruuje%n%s do rozpakowania do podfolderu o nazwie archiwum."
HELP_EXAMPLE1 = "%n%nPrzykład:"
HELP_EXAMPLE2 = "%n     %s c:\1\przykład.zip c:\test"
HELP_NOARGS = "%n%nUruchomienie %s bez żadnego argumentu %nzapyta użytkownika o nazwę pliku i folder docelowy."

; Error messages
CANNOT_LOG = "%s Wypakowywanie nie może być logowane"
CANNOT_DEBUG = "Katalog pliku debugera, "%s", jest chroniony przed zapisem.%nTwoj katalog tymczasowy (temp) bedzie uzywany zamiast ustawionego."
CANNOT_EXTRACT = "%s nie może być wypakowany.%nTyp pliku to: %s%n%nKilknij OK jeśli chcesz przeanalizować plik samodzielnie lub Anuluj aby wyjść."
UNKNOWN_EXT = "%s%nma nieznane rozszerzenie i nie może być wypakowany."
INVALID_DIR = "%s%nnie można utworzyć. Wybierz odpowiedni folder."
EXTRACT_FAILED = "%s nie można wypakować.%nWydaje się być %s, ale wypakowywanie nie powiodło się.%nSprawdź plik log, %s, aby uzyskać więcej informacji.%n%nKliknij OK aby zobaczyć plik log teraz lub Anuluj aby wyjść."

[Installer]
; Components page
COMP_DOCS = "Dokumentacja i informacja licencyjna"
COMP_LANG = "Pliki jezykowe do regionalizacji programu"
COMP_ACE = "Wsparcie dla plików ACE"
COMP_KGB = "Wsparcie dla plików KGB"
COMP_PEA = "Wsparcie dla plików Pea"
COMP_SIT = "Wsparcie dla plików StuffIt"

; Preferences page
PREFS_CAPTION = "Ustaw opcje programu"
PREFS_DESCRIPTION = "Które opcje Universal Extractor chcesz zmienić?"
PREFS_LABEL1 = "Możesz ustawić następujące opcje, aby określić domyślne zachowanie Universal Extractor."
PREFS_LABEL2 = "Ta opcja może być zmieniona przez modyfikację pliku UniExtract.ini."
LANGUAGE_LABEL = "Domyślny język"
DEBUG_LABEL = "Lokalizacja pliku debugowania"
APPEND_EXT_LABEL = "&Dodaj brakujące rozszerzenie pliku"
HISTORY_LABEL = "&Zachowaj historię archiwów"
REMOVE_DUPE_LABEL = "Usuń &zduplikowane pliki"
REMOVE_TEMP_LABEL = "Usuń &tymczasowe pliki"
WARN_EXECUTE_LABEL = "&Ostrzegaj przed wykonywaniem pliku"

; Tasks page
ASSOCIATE = "&Włącz integrację z menu kontekstowym Explorera"
ASSOCIATE_FILES = "Dodaj UniExtract &Pliki... do menu kontekstowego"
ASSOCIATE_HERE = "Dodaj UniExtract &Tutaj do menu kontekstowego"
ASSOCIATE_SUBDIR = "Dodaj UniExtract do &Podkatalogu do menu kontekstowego"
ASSOCIATE_FORCE = "Wymuś &powiązanie z wszystkimi wspieranymi formatami archiwów"
MODIFY_PATH = "Dodaj Universal Extractor do &ścieżki systemowej"
DESKTOP_ICON = "Utwórz &ikonę na pulpicie"
QUICK_LAUNCH_ICON = "Utwórz ikonę na &pasku szybkiego uruchamiania"
SENDTO_ICON = "Utwórz ikonę Wyślij&do"

; Context Menu integration
EXTRACT_FILES = "UniExtract &Pliki..."
EXTRACT_HERE = "UniExtract &Tutaj"
EXTRACT_SUB = "UniExtract do &Podkatalogu"
